{
 "courses": [
  {
    "title": "Communication",
    "img": "/img/team-work-svgrepo-com.svg",
    "description": "Develop professional communication skills for workplace success. Master verbal, non-verbal, and written techniques, including active listening, conflict resolution, and presentation delivery.",
    "path": "communication"
  },
  {
    "title": "Web Development",
    "img": "/img/web-development-svgrepo-com.svg",
    "description": "Build modern, responsive websites using HTML, CSS, JavaScript, and frameworks like React and Angular. Learn RESTful API integration, deployment strategies, and performance optimization.",
    "path": "web-development"
  },
  {
    "title": "App Development",
    "img": "/img/app-design-svgrepo-com.svg",
    "description": "Create cross-platform mobile apps using Flutter and Dart. Explore UI design, state management, API integration, and performance tuning for scalable mobile solutions.",
    "path": "app-development"
  },
  {
    "title": "UI/UX Design",
    "img": "/img/ui-states-svgrepo-com (2).svg",
    "description": "Master user-centered design principles, wireframing, prototyping, and usability testing. Use tools like Figma and Adobe XD to craft intuitive interfaces and seamless user experiences.",
    "path": "/trainings/uiux-development"
  },
  {
    "title": "Data Science",
    "img": "/img/data-analytics.svg",
    "description": "Learn data wrangling, statistical analysis, and machine learning using Python, Pandas, and Scikit-learn. Build predictive models and visualize insights with tools like Matplotlib and Tableau.",
    "path": "/trainings/data-science"
  },
  {
    "title": "Cyber Security",
    "img": "/img/worldwide-security-security-svgrepo-com.svg",
    "description": "Explore network security, ethical hacking, and threat mitigation. Learn encryption, vulnerability assessment, and incident response using industry-standard tools and frameworks.",
    "path": "/trainings/cybersecurity"
  },
  {
    "title": "Manual and Automation Testing",
    "img": "/img/automated-testing-svgrepo-com.svg",
    "description": "Master software testing fundamentals, including test case design, bug tracking, and automation with Selenium and Postman. Ensure quality through CI/CD integration and performance testing.",
    "path": "/trainings/testing"
  }
],
  "testing": [
  {
    "title": "Manual Testing Fundamentals",
    "description": "Master the core principles of manual testing, including test case design, defect tracking, and QA documentation standards.",
    "img": "/img/manual-testing.svg",
    "path": "/trainings/testing/manual-testing",
    "syllabus": [
      "QA methodologies and SDLC/STLC phases",
      "Test case creation and execution",
      "Bug life cycle and defect reporting",
      "Test plan and documentation standards",
      "Manual testing tools and workflows"
    ],
    "overview": [
      "Explore QA methodologies including SDLC/STLC, testing types, and QA’s role in agile and waterfall models.",
      "Write traceable test cases with clear steps, expected outcomes, and edge case coverage.",
      "Understand the bug life cycle, severity/priority classification, and defect triaging techniques.",
      "Apply documentation standards like test plans, traceability matrices, and structured reporting formats.",
      "Use tools like TestLink, Zephyr, and Excel for manual test execution and tracking."
    ]
  },
  {
    "title": "Selenium WebDriver Automation",
    "description": "Automate web applications using Selenium WebDriver with Java or Python. Build scalable frameworks using Page Object Model and CI integration.",
    "img": "/img/automated-testing.svg",
    "path": "/trainings/testing/selenium-automation",
    "syllabus": [
      "Selenium architecture and WebDriver APIs",
      "Writing test cases using Java/Python",
      "Locators, waits, and browser actions",
      "Page Object Model and reusable components",
      "Framework design and automation reporting"
    ],
    "overview": [
      "Understand Selenium’s architecture and how WebDriver interacts with browsers.",
      "Write maintainable test scripts using Java or Python with best practices.",
      "Use locators (XPath, CSS), waits, and simulate user interactions like clicks and form inputs.",
      "Implement Page Object Model for modular, reusable automation components.",
      "Design frameworks with reporting tools like ExtentReports, Allure, and CI/CD integration."
    ]
  },
  {
    "title": "API Testing with Postman",
    "description": "Test RESTful APIs using Postman and automate workflows with Newman. Validate responses, chain requests, and integrate with CI/CD pipelines.",
    "img": "/img/postman.svg",
    "path": "/trainings/testing/api-testing",
    "syllabus": [
      "Understanding RESTful APIs and endpoints",
      "Request types and parameterization",
      "Response validation and chaining requests",
      "Automated API tests and environments",
      "Integrating API tests in CI/CD pipelines"
    ],
    "overview": [
      "Learn RESTful architecture, HTTP methods, and endpoint structures.",
      "Send dynamic requests with headers, parameters, and authentication tokens.",
      "Validate responses using assertions and chain requests with environment variables.",
      "Automate test suites using Postman Collections and Newman CLI.",
      "Integrate API tests into CI/CD pipelines using Jenkins, GitHub Actions, or Azure DevOps."
    ]
  },
  {
    "title": "Mobile App Testing",
    "description": "Test mobile applications across platforms using emulators, real devices, and automation tools like Appium and Espresso.",
    "img": "/img/mobile-app.svg",
    "path": "/trainings/testing/mobile-testing",
    "syllabus": [
      "Mobile testing platforms and emulators",
      "iOS vs Android architecture differences",
      "UI testing for various screen sizes",
      "Device compatibility and performance testing",
      "Mobile automation using Appium or Espresso"
    ],
    "overview": [
      "Set up mobile testing environments using emulators, simulators, and real devices.",
      "Understand platform-specific architecture and OS-level constraints.",
      "Validate UI responsiveness across screen sizes and orientations.",
      "Conduct compatibility and performance testing under varied conditions.",
      "Automate mobile tests using Appium (cross-platform) or Espresso (Android-native)."
    ]
  },
  {
    "title": "Performance Testing",
    "description": "Evaluate system performance using JMeter and LoadRunner. Simulate load, analyze bottlenecks, and integrate with CI workflows.",
    "img": "/img/performance-testing.svg",
    "path": "/trainings/testing/performance-testing",
    "syllabus": [
      "Principles of performance testing",
      "Test strategy for scalability and stability",
      "Using JMeter for load and stress tests",
      "Interpreting results and bottleneck analysis",
      "Integrating performance tests into CI workflows"
    ],
    "overview": [
      "Understand performance metrics like throughput, latency, and concurrency.",
      "Design test strategies for real-world usage and peak load conditions.",
      "Use JMeter to configure thread groups, samplers, and assertions.",
      "Analyze results to identify bottlenecks in CPU, memory, DB, and network.",
      "Integrate performance tests into CI workflows using Jenkins or GitLab CI."
    ]
  },
  {
    "title": "Test Automation Framework",
    "description": "Design scalable test automation frameworks using modular architecture, data-driven testing, and CI/CD integration.",
    "img": "/img/automation.svg",
    "path": "/trainings/testing/automation-framework",
    "syllabus": [
      "Framework architecture and components",
      "Keyword and data-driven testing design",
      "Integrating test libraries and utilities",
      "CI/CD tool integration with automation",
      "Custom reporting and logging strategies"
    ],
    "overview": [
      "Build layered automation frameworks with reusable components and separation of concerns.",
      "Implement keyword-driven and data-driven testing using Excel, JSON, or DB inputs.",
      "Integrate libraries like Selenium, RestAssured, and TestNG for unified automation.",
      "Connect automation pipelines with Jenkins, GitHub Actions, or Azure DevOps.",
      "Create custom reporting dashboards using ExtentReports, Allure, and HTML logs."
    ]
  }
],
  "webDevelopment": [
    {
  "title": "Java Full Stack",
  "img": "/img/java-svgrepo-com.svg",
  "description": "Master front-end and back-end development using Java. Learn Spring Boot, RESTful APIs, JSP, and database integration to build scalable web applications.",
  "path": "/trainings/web-development/java-fullstack",
  "syllabus": [
    "Java Fundamentals and OOP",
    "HTML/CSS/JS Basics",
    "Spring Boot Framework",
    "RESTful APIs with Spring",
    "JSP and Servlet Integration",
    "Database Connectivity (JDBC/MySQL)",
    "Deploying Java Apps to the Web"
  ],
  "overview": [
    "Master Java syntax, object-oriented principles, and core programming constructs for backend development.",
    "Build responsive UIs using HTML, CSS, and JavaScript fundamentals with semantic structure and styling.",
    "Develop scalable applications using Spring Boot, dependency injection, and RESTful service layers.",
    "Create and consume REST APIs with Spring annotations, controllers, and JSON data exchange.",
    "Integrate JSP and Servlets for dynamic content rendering and session management in web apps.",
    "Connect Java applications to MySQL using JDBC, handle queries, and manage relational data.",
    "Deploy Java web apps using WAR packaging, Tomcat servers, and cloud-ready configurations."
  ]
},
{
  "title": "Python Full Stack",
  "img": "/img/python-svgrepo-com.svg",
  "description": "Learn Python for web development, data analysis, and automation. Build applications using Django or Flask and explore database and REST API integrations.",
  "path": "/trainings/web-development/python",
  "syllabus": [
    "Python Syntax and Data Types",
    "Working with APIs",
    "Flask Framework Basics",
    "Django MVC Structure",
    "Database Models and ORM",
    "Authentication and Authorization",
    "Deploying Python Web Apps"
  ],
  "overview": [
    "Learn Python syntax, control structures, and data types for backend scripting and automation.",
    "Interact with REST APIs using requests, handle JSON responses, and integrate third-party services.",
    "Build lightweight web apps with Flask, routing, templating, and form handling.",
    "Use Django’s MVC architecture to structure scalable apps with models, views, and templates.",
    "Define database models using Django ORM, perform migrations, and manage relational data.",
    "Implement secure authentication flows with login systems, user roles, and access control.",
    "Deploy Python apps to platforms like Heroku or AWS with environment configs and version control."
  ]
},
{
  "title": ".NET Full Stack",
  "img": "/img/dotnet-svgrepo-com.svg",
  "description": "Build dynamic applications with ASP.NET Core, C#, and SQL Server. Develop robust front-end interfaces using Blazor or JavaScript frameworks.",
  "path": "/trainings/web-development/dotnet",
  "syllabus": [
    "C# Basics and OOP",
    "ASP.NET Core Architecture",
    "Entity Framework for Data Access",
    "RESTful APIs in .NET",
    "SQL Server Integration",
    "Blazor and Razor Components",
    "Unit Testing and Deployment"
  ],
  "overview": [
    "Learn C# syntax, object-oriented design, and reusable class structures for backend logic.",
    "Understand ASP.NET Core architecture, middleware, and dependency injection for scalable apps.",
    "Use Entity Framework to model data, perform migrations, and query SQL databases efficiently.",
    "Build RESTful APIs with controllers, routing, and JSON serialization in .NET Core.",
    "Integrate SQL Server for persistent storage, relational queries, and schema design.",
    "Create dynamic UIs using Blazor or Razor components with two-way binding and event handling.",
    "Write unit tests with xUnit or MSTest and deploy apps using IIS, Docker, or Azure pipelines."
  ]
},
{
  "title": "MERN Stack",
  "img": "/img/react-svgrepo-com.svg",
  "description": "Become proficient in MongoDB, Express.js, React, and Node.js. Learn to build full-stack JavaScript applications from the ground up to advance.",
  "path": "/trainings/web-development/mern",
  "syllabus": [
    "JavaScript ES6+ Syntax",
    "Node.js Backend Fundamentals",
    "Express.js Routing and Middleware",
    "MongoDB CRUD and Mongoose",
    "React Components and Hooks",
    "API Integration with Axios",
    "Full-stack Deployment with Heroku"
  ],
  "overview": [
    "Master modern JavaScript features including arrow functions, promises, destructuring, and modules.",
    "Build backend logic with Node.js, handle asynchronous operations, and manage server-side workflows.",
    "Use Express.js to define routes, apply middleware, and structure RESTful APIs.",
    "Perform CRUD operations with MongoDB and model schemas using Mongoose for data validation.",
    "Create dynamic UIs with React components, manage state using hooks, and handle user interactions.",
    "Integrate APIs using Axios for data fetching, error handling, and lifecycle management.",
    "Deploy full-stack apps to Heroku with environment variables, build scripts, and Git workflows."
  ]
},
{
  "title": "MEAN Stack",
  "img": "/img/angular-icon-svgrepo-com.svg",
  "description": "Learn how to create full-stack web applications using MongoDB, Express.js, Angular, and Node.js with real-time data handling and dynamic UI.",
  "path": "/trainings/web-development/mean",
  "syllabus": [
    "Node.js and Express Setup",
    "Angular Architecture and Modules",
    "MongoDB with Mongoose",
    "Angular Components and Services",
    "Reactive Forms and Observables",
    "Express API Design",
    "Real-time Data with Socket.io"
  ],
  "overview": [
    "Set up Node.js servers and Express routes with middleware for secure and scalable APIs.",
    "Understand Angular’s modular architecture, CLI tooling, and component-based design.",
    "Model MongoDB schemas with Mongoose, perform CRUD operations, and validate data.",
    "Build Angular components and services for reusable UI logic and dependency injection.",
    "Use reactive forms and RxJS observables to manage dynamic user input and async flows.",
    "Design RESTful APIs with Express, handle routing, and connect frontend to backend seamlessly.",
    "Implement real-time communication using Socket.io for chat, notifications, and live updates."
  ]
}

  ],

  "appDevelopment":[
  {
  "title": "Flutter",
  "img": "/img/flutter-svgrepo-com (1).svg",
  "description": "Build beautiful native mobile apps using Flutter and Dart. Learn to develop cross-platform applications with expressive UIs and strong back-end integration.",
  "path": "/trainings/app-development/flutter",
  "syllabus": [
    "Dart Basics and Data Structures",
    "Flutter Widgets and Layouts",
    "State Management with Provider",
    "Navigation and Routing",
    "Firebase Integration",
    "REST API Consumption",
    "Building & Publishing Apps"
  ],
  "overview": [
    "Learn Dart syntax, data structures, and object-oriented principles for mobile logic.",
    "Use Flutter widgets to build responsive layouts with flexible UI components.",
    "Manage app state using Provider for reactive updates and modular architecture.",
    "Implement navigation flows with named routes, transitions, and deep linking.",
    "Integrate Firebase for authentication, cloud storage, and real-time database access.",
    "Consume REST APIs with HTTP packages, handle JSON parsing, and manage network errors.",
    "Build release-ready apps and publish to Play Store or App Store with platform-specific configs."
  ]
},{
  "title": "React Native",
  "img": "/img/react-svgrepo-com.svg",
  "description": "Learn to build cross-platform mobile apps using React Native. Leverage your React skills to create native UIs, access device features, optimize performance, and across platforms.",
  "path": "/trainings/app-development/react-native",
  "syllabus": [
    "Introduction to React Native",
    "Building UI with Components",
    "State Management with Redux",
    "Navigation and Routing",
    "Accessing Device APIs",
    "Testing and Debugging",
    "Publishing Apps"
  ],
  "overview": [
    "Understand the fundamentals of React Native and its architecture.",
    "Build user interfaces using React Native components and styles.",
    "Manage application state with Redux for predictable state management.",
    "Implement navigation using React Navigation for seamless user experiences.",
    "Access device features like camera, location, and storage with native modules.",
    "Test and debug React Native apps using tools like Jest and Reactotron.",
    "Prepare and publish apps to the App Store and Google Play."
  ]
}
  ],
  "uiuxDevelopment": [
    {
  "title": "Graphic Design",
  "img": "/img/arrange-graphic-design-graphic-tool-svgrepo-com.svg",
  "description": "Master the visual side of design with tools like Photoshop, Illustrator, and Canva. Learn color theory, typography, branding, and layout skills.",
  "path": "/trainings/uiux-development/graphic-design",
  "syllabus": [
    "Introduction to visual design principles",
    "Color theory and composition",
    "Typography and font psychology",
    "Creating assets using Photoshop and Illustrator",
    "Branding and logo creation with Canva"
  ],
  "overview": [
    "Learn foundational design principles including balance, contrast, hierarchy, and alignment to create visually coherent layouts.",
    "Explore color theory, palettes, and composition techniques to evoke emotion and guide user attention effectively.",
    "Understand typography fundamentals, font pairing, and psychological impact of typefaces in branding and readability.",
    "Create professional-grade assets using Photoshop and Illustrator, including icons, banners, and layered compositions.",
    "Design logos and brand kits using Canva, applying layout grids, brand consistency, and export-ready formats."
  ]
},{
  "title": "Design Tools Mastery",
  "img": "/img/web-design-svgrepo-com.svg",
  "description": "Get hands-on experience with tools like Figma, Adobe XD, and Sketch. Learn to design high-fidelity prototypes and collaborate with developers.",
  "path": "/trainings/uiux-development/design-tools-mastery",
  "syllabus": [
    "UI basics and atomic design in Figma",
    "Wireframing and prototyping in Adobe XD",
    "Responsive layout techniques with Sketch",
    "Design handoff workflow to developers",
    "Version control and collaboration in design tools"
  ],
  "overview": [
    "Master UI fundamentals and atomic design principles in Figma, including reusable components and design systems.",
    "Build wireframes and interactive prototypes in Adobe XD, simulating user flows and validating design intent.",
    "Apply responsive layout strategies in Sketch using grids, constraints, and adaptive resizing for multiple devices.",
    "Streamline developer handoff with annotated specs, exportable assets, and design tokens for implementation.",
    "Collaborate using version control features, shared libraries, and real-time feedback tools across design platforms."
  ]
},{
  "title": "Interaction Design",
  "img": "/img/touch-svgrepo-com.svg",
  "description": "Understand how users interact with interfaces. Focus on animations, transitions, microinteractions, and behavior-based design patterns and layouts skills.",
  "path": "/trainings/uiux-development/interaction-design",
  "syllabus": [
    "Principles of interaction and behavior-based UX",
    "Animation theory and motion guidelines",
    "Microinteractions: design and intent",
    "Page transitions and feedback design",
    "User testing and refinement"
  ],
  "overview": [
    "Explore interaction design principles including affordance, feedback, and behavioral UX patterns that guide user actions.",
    "Apply animation theory to create smooth transitions, easing curves, and motion that enhances usability and delight.",
    "Design microinteractions for buttons, toggles, and notifications that reinforce user intent and system response.",
    "Craft page transitions and feedback mechanisms that maintain context and reduce cognitive load during navigation.",
    "Conduct usability testing, gather feedback, and iterate designs based on real user behavior and performance metrics."
  ]
}
  ],

  "Communication": [
   {
  "title": "Group Discussion",
  "description": "Learn techniques to effectively participate in group discussions. Improve clarity, confidence, and critical thinking to stand out in competitive environments.",
  "img":"/img/group-talk-svgrepo-com.svg",
  "path": "/trainings/communication/group-discussion",
  "syllabus": [
    "Introduction to Group Discussions",
    "Key Traits of Effective Communicators",
    "Structuring Your Thoughts: PREP & STAR Techniques",
    "Active Listening & Constructive Feedback",
    "Handling Interruptions & Dominant Participants",
    "Mock GDs with Peer Review",
    "Evaluation Metrics: Content, Delivery, Team Dynamics"
  ],
  "overview": [
    "Understand the purpose, format, and dynamics of group discussions in academic and professional settings.",
    "Identify and cultivate traits like clarity, assertiveness, empathy, and confidence for impactful communication.",
    "Learn structured thinking techniques like PREP and STAR to organize ideas and respond with precision.",
    "Practice active listening, give constructive feedback, and build collaborative dialogue in group settings.",
    "Develop strategies to manage interruptions, assert your voice, and handle dominant participants tactfully.",
    "Participate in mock GDs with peer review to simulate real scenarios and refine delivery.",
    "Get evaluated on content relevance, delivery style, and team interaction using standardized metrics."
  ]
},{
  "title": "Vocabulary Building",
  "description": "Enhance your word power with daily vocabulary, idioms, and phrases. Strengthen your communication and comprehension skills for academic and professional success.",
  "img":"/img/vocabulary-svgrepo-com.svg",
  "path": "/trainings/communication/vocabulary-building",
  "syllabus": [
    "Daily Word Lists with Contextual Usage",
    "Idioms, Phrases & Collocations",
    "Synonyms, Antonyms & Word Families",
    "Vocabulary for Academic Writing & Interviews",
    "Root Words, Prefixes & Suffixes",
    "Interactive Quizzes & Flashcards",
    "Weekly Vocabulary Challenges & Peer Games"
  ],
  "overview": [
    "Build vocabulary through curated daily word lists with real-world usage and contextual examples.",
    "Learn idiomatic expressions, collocations, and phrases to enhance fluency and natural speech.",
    "Expand your lexical range with synonyms, antonyms, and word families for nuanced expression.",
    "Apply vocabulary in academic writing, interviews, and formal communication with precision.",
    "Understand word formation through roots, prefixes, and suffixes to decode unfamiliar terms.",
    "Engage with interactive quizzes, flashcards, and spaced repetition for long-term retention.",
    "Participate in weekly challenges and peer games to reinforce learning in a fun, competitive format."
  ]
},{
  "title": "Presentation Skills",
  "description": "Master the art of delivering professional presentations. Learn to use visuals, storytelling, and audience engagement to make your ideas memorable.",
  "img": "/img/data-analytics.svg",
  "path": "/trainings/communication/presentation-skills",
  "syllabus": [
    "Fundamentals of Public Speaking",
    "Structuring a Presentation: Hook, Body, Close",
    "Visual Aids: Charts, Slides, and Infographics",
    "Storytelling Techniques for Impact",
    "Voice Modulation, Body Language & Eye Contact",
    "Handling Q&A and Audience Engagement",
    "Practice Sessions with Peer & Mentor Feedback"
  ],
  "overview": [
    "Learn public speaking essentials including tone, pace, posture, and audience connection.",
    "Structure presentations with compelling openings, logical flow, and memorable conclusions.",
    "Use visual aids like charts, infographics, and slides to support and enhance your message.",
    "Apply storytelling techniques to create emotional resonance and narrative clarity.",
    "Refine delivery with voice modulation, confident body language, and effective eye contact.",
    "Handle audience questions with poise, redirect discussions, and maintain engagement.",
    "Practice presentations with peer and mentor feedback to polish content and delivery."
  ]
},{
  "title": "Interview Techniques",
  "description": "Prepare for job interviews with confidence. Learn body language, mock interview techniques, and strategies to answer technical and HR questions effectively.",
  "img": "/img/reunion-interview-svgrepo-com.svg",
  "path": "/trainings/communication/interview-techniques",
  "syllabus": [
    "Types of Interviews: HR, Technical, Behavioral",
    "Crafting Strong Self-Introductions",
    "STAR Method for Behavioral Questions",
    "Body Language & Confidence Building",
    "Common Technical & HR Questions",
    "Mock Interviews with Feedback",
    "Post-Interview Etiquette & Follow-ups"
  ],
  "overview": [
    "Understand formats and expectations of HR, technical, and behavioral interviews across industries.",
    "Craft compelling self-introductions that highlight strengths, goals, and professional identity.",
    "Use the STAR method to answer behavioral questions with clarity, relevance, and structure.",
    "Develop confident body language, tone control, and presence to make lasting impressions.",
    "Prepare for frequently asked technical and HR questions with tailored, authentic responses.",
    "Participate in mock interviews with feedback to refine articulation and reduce anxiety.",
    "Learn post-interview etiquette including thank-you notes, follow-ups, and professional closure."
  ]
}
  ],
  "cyberSecurity": [
    {
  "title": "Ethical Hacking Fundamentals",
  "description": "Learn the basics of ethical hacking, penetration testing, and vulnerability assessment techniques.",
  "img": "/img/application-security-svgrepo-com.svg",
  "path": "/trainings/cybersecurity/ethical-hacking",
  "syllabus": [
    "Introduction to Ethical Hacking & Legal Frameworks",
    "Footprinting and Reconnaissance Techniques",
    "Scanning Networks and Enumeration",
    "System Hacking and Privilege Escalation",
    "Malware Types and Delivery Mechanisms",
    "Sniffing, Spoofing, and Session Hijacking",
    "Web Application Attacks (SQLi, XSS, CSRF)",
    "Wireless Network Hacking Basics",
    "Penetration Testing Methodologies",
    "Reporting and Documentation Best Practices"
  ],
  "overview": [
    "Understand the scope of ethical hacking, legal boundaries, and compliance with cybersecurity laws.",
    "Learn passive and active reconnaissance methods to gather intelligence on targets.",
    "Perform network scanning and enumeration to identify open ports, services, and vulnerabilities.",
    "Explore system exploitation techniques including password cracking and privilege escalation.",
    "Analyze malware types, delivery vectors, and payload behaviors in compromised systems.",
    "Simulate sniffing, spoofing, and hijacking attacks to understand network-level threats.",
    "Execute web-based attacks like SQL injection, XSS, and CSRF to test application security.",
    "Discover wireless hacking tools and techniques for cracking WEP/WPA and rogue access points.",
    "Apply structured penetration testing methodologies including planning, execution, and validation.",
    "Document findings with professional reports, risk ratings, and remediation recommendations."
  ]
},{
  "title": "Network Security",
  "description": "Master network security protocols, firewalls, VPNs, and intrusion detection systems.",
  "img": "/img/networking-monitor-svgrepo-com.svg",
  "path": "/trainings/cybersecurity/network-security",
  "syllabus": [
    "Network Architecture and Protocols (TCP/IP, DNS, DHCP)",
    "Firewalls: Configuration and Management",
    "VPNs and Secure Remote Access",
    "Intrusion Detection and Prevention Systems (IDS/IPS)",
    "Network Segmentation and Zero Trust Models",
    "Secure Routing and Switching",
    "Threats to Network Infrastructure (DDoS, MITM)",
    "Network Monitoring and Traffic Analysis",
    "Implementing Network Access Control (NAC)",
    "Hands-on Labs with Wireshark and Nmap"
  ],
  "overview": [
    "Understand core network protocols and architectures including TCP/IP stack, DNS resolution, and DHCP operations.",
    "Configure and manage firewalls to enforce access control policies and prevent unauthorized traffic.",
    "Implement VPNs for encrypted remote access and secure tunneling across public networks.",
    "Deploy IDS/IPS systems to detect and prevent malicious activity in real-time.",
    "Design segmented networks using VLANs and apply Zero Trust principles for enhanced security.",
    "Secure routing and switching infrastructure with ACLs, port security, and protocol hardening.",
    "Mitigate threats like DDoS, MITM, and spoofing attacks through layered defense strategies.",
    "Monitor traffic patterns and analyze packets using tools like Wireshark for anomaly detection.",
    "Enforce NAC policies to control device access based on identity, posture, and compliance.",
    "Perform hands-on labs using Wireshark and Nmap to simulate real-world network defense scenarios."
  ]
},{
  "title": "Incident Response & Forensics",
  "description": "Learn digital forensics, incident response procedures, and cyber crime investigation techniques.",
  "img": "/img/incident-maintenance-svgrepo-com.svg",
  "path": "/trainings/cybersecurity/incident-response",
  "syllabus": [
    "Introduction to Incident Response Lifecycle",
    "Identifying and Classifying Security Incidents",
    "Evidence Collection and Chain of Custody",
    "Disk and Memory Forensics",
    "Log Analysis and Timeline Reconstruction",
    "Malware Triage and Behavioral Analysis",
    "Reporting and Communication Protocols",
    "Legal and Regulatory Considerations",
    "Hands-on Case Studies and Simulations",
    "Tools: Autopsy, Volatility, FTK Imager"
  ],
  "overview": [
    "Explore the phases of incident response including preparation, detection, containment, and recovery.",
    "Classify security incidents based on severity, scope, and impact to prioritize response efforts.",
    "Collect digital evidence while maintaining chain of custody for legal admissibility.",
    "Perform disk and memory forensics to extract volatile and persistent data from compromised systems.",
    "Analyze logs to reconstruct attack timelines and identify indicators of compromise.",
    "Conduct malware triage to assess behavior, persistence, and propagation techniques.",
    "Create incident reports and follow structured communication protocols for stakeholders.",
    "Understand legal obligations and compliance requirements during forensic investigations.",
    "Work through simulated breach scenarios to apply forensic techniques in real time.",
    "Use industry tools like Autopsy, Volatility, and FTK Imager for hands-on forensic analysis."
  ]
},{
  "title": "Security Risk Assessment",
  "description": "Understand risk assessment methodologies, compliance frameworks, and security auditing practices.",
  "img": "/img/security-shield-svgrepo-com.svg",
  "path": "/trainings/cybersecurity/risk-assessment",
  "syllabus": [
    "Risk Management Fundamentals",
    "Identifying Assets, Threats, and Vulnerabilities",
    "Quantitative vs. Qualitative Risk Analysis",
    "Security Controls and Mitigation Strategies",
    "Compliance Frameworks (ISO 27001, NIST, GDPR)",
    "Security Auditing Techniques",
    "Business Impact Analysis (BIA)",
    "Risk Reporting and Stakeholder Communication",
    "Continuous Monitoring and Improvement",
    "Case Studies: Real-world Risk Assessments"
  ],
  "overview": [
    "Learn the principles of risk management including threat modeling and impact analysis.",
    "Identify critical assets, potential threats, and vulnerabilities across organizational systems.",
    "Apply both quantitative and qualitative methods to assess and prioritize risks.",
    "Design and implement security controls to mitigate identified risks effectively.",
    "Align assessments with compliance frameworks like ISO 27001, NIST, and GDPR.",
    "Conduct security audits using checklists, interviews, and technical assessments.",
    "Perform BIA to evaluate the operational impact of security incidents on business functions.",
    "Communicate risk findings to stakeholders using structured reporting formats.",
    "Establish continuous monitoring practices to track evolving threats and control effectiveness.",
    "Analyze real-world case studies to understand practical risk assessment applications."
  ]
},{
  "title": "Malware Analysis",
  "description": "Analyze malware behavior, reverse engineering techniques, and threat intelligence gathering.",
  "img": "/img/virus-svgrepo-com.svg",
  "path": "/trainings/cybersecurity/malware-analysis",
  "syllabus": [
    "Introduction to Malware Types and Behaviors",
    "Static vs. Dynamic Analysis Techniques",
    "Setting Up a Safe Malware Lab",
    "Reverse Engineering with Ghidra and IDA Pro",
    "Behavioral Analysis with Cuckoo Sandbox",
    "Obfuscation and Anti-analysis Techniques",
    "Indicators of Compromise (IOCs)",
    "Threat Intelligence Platforms and Feeds",
    "Malware Attribution and Campaign Tracking",
    "Hands-on Analysis of Real Malware Samples"
  ],
  "overview": [
    "Understand malware categories including trojans, ransomware, worms, and their behavioral traits.",
    "Apply static and dynamic analysis techniques to dissect malware binaries and runtime behavior.",
    "Set up isolated lab environments for safe malware execution and observation.",
    "Use reverse engineering tools like Ghidra and IDA Pro to analyze code structure and logic.",
    "Perform behavioral analysis using Cuckoo Sandbox to monitor file system, registry, and network activity.",
    "Detect obfuscation methods and anti-analysis tactics used to evade detection.",
    "Identify IOCs such as file hashes, domains, and registry keys for threat hunting.",
    "Leverage threat intelligence platforms to correlate malware campaigns and actor profiles.",
    "Track malware attribution across campaigns using behavioral signatures and metadata.",
    "Analyze real malware samples to apply learned techniques in practical scenarios."
  ]
},
    {
  "title": "Cloud Security",
  "description": "Secure cloud infrastructure, implement cloud security best practices, and manage cloud compliance.",
  "img": "/img/cloud-computing-cloud-security-network-password-network-security-privacy-code-svgrepo-com.svg",
  "path": "/trainings/cybersecurity/cloud-security",
  "syllabus": [
    "Cloud Computing Models (IaaS, PaaS, SaaS)",
    "Shared Responsibility Model",
    "Identity and Access Management (IAM) in Cloud",
    "Securing Cloud Storage and Databases",
    "Cloud Network Security and Monitoring",
    "Encryption and Key Management in Cloud",
    "Cloud Compliance Standards (SOC 2, HIPAA, PCI-DSS)",
    "Incident Response in Cloud Environments",
    "Cloud Security Posture Management (CSPM)",
    "Hands-on Labs with AWS, Azure, and GCP"
  ],
  "overview": [
    "Understand cloud service models (IaaS, PaaS, SaaS) and how they impact security architecture and control layers.",
    "Apply the Shared Responsibility Model to define boundaries between cloud provider and customer obligations.",
    "Implement IAM policies for secure access control, role-based permissions, and multi-factor authentication.",
    "Secure cloud storage and databases using encryption, access policies, and data classification techniques.",
    "Monitor cloud networks for anomalies using flow logs, firewalls, and intrusion detection systems.",
    "Manage encryption keys and secrets using cloud-native KMS solutions and vault integrations.",
    "Align cloud deployments with compliance standards like SOC 2, HIPAA, and PCI-DSS through audits and controls.",
    "Develop incident response plans tailored to cloud environments, including log collection and forensic readiness.",
    "Use CSPM tools to continuously assess cloud configurations, detect misconfigurations, and enforce policies.",
    "Perform hands-on labs across AWS, Azure, and GCP to apply security controls in real-world cloud setups."
  ]
}
  ],
  "dataScience": [
   {
  "title": "Machine Learning",
 "description": "Learn to build predictive models that forecast outcomes using supervised, unsupervised, and reinforcement learning techniques. Gain hands-on experience with algorithms like decision trees.",
  "img": "/img/machine learning.png",
  "path": "/trainings/data-science/machine-learning",
  "syllabus": [
    "Introduction to supervised and unsupervised learning",
    "Model training and evaluation techniques",
    "Overfitting, regularization, and bias-variance tradeoff",
    "Feature selection and engineering",
    "Introduction to reinforcement learning and its applications"
  ],
  "overview": [
    "Explore the foundations of supervised and unsupervised learning, including classification and clustering algorithms.",
    "Apply model training workflows with cross-validation, performance metrics, and iterative tuning.",
    "Understand overfitting, regularization methods (L1/L2), and the bias-variance tradeoff for generalization.",
    "Engineer and select features using statistical techniques, domain knowledge, and dimensionality reduction.",
    "Get introduced to reinforcement learning concepts like agents, environments, rewards, and policy optimization."
  ]
},
{
  "title": "Artificial Intelligence",
 "description": "Create intelligent systems that mimic human cognition and decision-making, covering NLP, robotics, and symbolic reasoning. Understand how AI powers automation in modern industries.",
  "img": "/img/artificialintelligence.png",
  "path": "/trainings/data-science/artificial-intelligence",
  "syllabus": [
    "Fundamentals of AI and intelligent agents",
    "Natural Language Processing basics",
    "Rule-based and expert systems",
    "AI in robotics and automation",
    "Ethical implications of artificial intelligence"
  ],
  "overview": [
    "Understand the core principles of AI, including intelligent agents, environments, and decision-making.",
    "Explore NLP techniques for text preprocessing, sentiment analysis, and language modeling.",
    "Design rule-based systems and expert systems using inference engines and knowledge bases.",
    "Apply AI in robotics for perception, planning, and autonomous control systems.",
    "Evaluate ethical concerns around AI bias, transparency, accountability, and societal impact."
  ]
},
{
  "title": "Generative AI",
  "description": "Learn to build and apply generative models that create text, images, code, and more. Explore LLMs, diffusion models, prompt engineering, and ethical deployment strategies.",
  "img": "/img/ai-ai-svgrepo-com.svg",
  "path": "/trainings/data-science/generative-ai",
  "syllabus": [
    "Introduction to Generative AI and model architectures",
    "Large Language Models (LLMs) and transformer-based systems",
    "Prompt engineering and fine-tuning techniques",
    "Text, image, and code generation using foundation models",
    "Ethical considerations and responsible AI deployment"
  ],
  "overview": [
    "Understand the foundations of Generative AI, including autoregressive models, transformers, and diffusion-based architectures.",
    "Explore how LLMs like GPT and BERT generate coherent text, answer questions, and assist in creative tasks.",
    "Master prompt engineering strategies to guide model outputs, improve relevance, and reduce hallucinations.",
    "Apply generative models to create text, images, and code using tools like Hugging Face, OpenAI APIs, and Stability AI.",
    "Evaluate ethical challenges such as bias, misinformation, copyright, and model interpretability in real-world deployments."
  ]
},
{
  "title": "Data Visualization",
"description": "Turn raw data into compelling visual insights using tools like Tableau, Power BI, and D3.js. Learn to design dashboards, interactive charts, and storytelling visuals that drive decision-making and  patterns.",
  "img": "/img/datavisualization.png",
  "path": "/trainings/data-science/data-visualization",
  "syllabus": [
    "Principles of data storytelling",
    "Working with Tableau dashboards",
    "Interactive charts and maps in Power BI",
    "Custom visualizations with D3.js",
    "Best practices for visual integrity and clarity"
  ],
  "overview": [
    "Learn the fundamentals of data storytelling, including audience targeting and narrative flow.",
    "Build dynamic dashboards in Tableau with filters, parameters, and calculated fields.",
    "Create interactive visualizations in Power BI using slicers, maps, and drill-throughs.",
    "Develop custom visuals in D3.js with SVG, transitions, and data binding.",
    "Apply design best practices to ensure clarity, accuracy, and ethical representation of data."
  ]
},{
  "title": "Big Data",
"description": "Handle massive, complex datasets with Hadoop and Spark to uncover patterns, trends, and anomalies.Real-time analytics, and scalable architecture design for enterprise-grade data solutions.",
  "img": "/img/bigdata.png",
  "path": "/trainings/data-science/big-data",
  "syllabus": [
    "Understanding big data challenges and characteristics",
    "Introduction to Hadoop ecosystem",
    "Real-time data processing with Apache Spark",
    "Distributed storage and computation strategies",
    "Big data use cases and architecture design"
  ],
  "overview": [
    "Identify the volume, velocity, and variety challenges of big data systems.",
    "Explore Hadoop components like HDFS, MapReduce, and YARN for batch processing.",
    "Use Apache Spark for real-time analytics with RDDs, DataFrames, and streaming APIs.",
    "Design distributed architectures with fault tolerance, scalability, and parallelism.",
    "Analyze real-world big data use cases in finance, healthcare, and IoT."
  ]
},{
  "title": "Deep Learning",
"description": "Use advanced neural networks like CNNs, RNNs, and transformers to solve tasks in image recognition,and generative modeling. Build and deploy models using TensorFlow and PyTorch with real-world datasets.",
  "img": "/img/deeplearning.png",
  "path": "/trainings/data-science/deep-learning",
  "syllabus": [
    "Neural network fundamentals",
    "CNNs for image classification",
    "RNNs and sequence modeling",
    "Transfer learning and pre-trained models",
    "Deep learning frameworks: TensorFlow and PyTorch"
  ],
  "overview": [
    "Understand the architecture of feedforward neural networks and backpropagation.",
    "Apply CNNs for image classification, object detection, and feature extraction.",
    "Use RNNs and LSTMs for time series forecasting and NLP tasks.",
    "Leverage transfer learning with pre-trained models like ResNet and BERT.",
    "Build and train models using TensorFlow and PyTorch with hands-on labs."
  ]
},{
  "title": "Data Analytics",
 "description": "Analyze structured and unstructured business data using statistical methods, BI tools. Learn to extract actionable insights, visualize trends, and support strategic decision-making across industries.",
  "img": "/img/dataanalytics.png",
  "path": "/trainings/data-science/data-analytics",
  "syllabus": [
    "Exploratory data analysis (EDA)",
    "Data wrangling and cleaning techniques",
    "Statistical analysis and hypothesis testing",
    "BI tools for dashboard creation",
    "Deriving insights from qualitative and quantitative data"
  ],
  "overview": [
    "Perform EDA using visual summaries, distributions, and correlation analysis.",
    "Clean and transform data using techniques like imputation, normalization, and parsing.",
    "Apply statistical methods for hypothesis testing, regression, and significance analysis.",
    "Use BI tools to build dashboards that communicate trends and KPIs effectively.",
    "Extract actionable insights from both structured datasets and qualitative sources."
  ]
}
  ],
  "testimonials": [
    {
      "name": "Naveen ",
      "role": "Software Engineer",
      "feedback": "The training was comprehensive and the instructors were very knowledgeable."
    },
    {
      "name": "Mani Kiran",
      "role": "Data Scientist",
      "feedback": "I learned so much about data analytics and machine learning. Highly recommend!"
    },
    {
      "name": "Keerthi",
      "role": "Web Developer",
      "feedback": "The React JS course helped me build my first full-stack application. Great experience!"
    }
  ],
  "workProcess": [
    {
      "title": "First-Class Business Solutions",
      "description": "We deliver strategic solutions that enhance organizational performance and productivity. From leadership development to workflow optimization, our services are built to meet modern business challenges."
    },
    {
      "title": "Corporate Training Programs",
      "description": "We design training programs that develop both technical skills and leadership qualities. Our goal is to help your teams stay competitive and confident in a rapidly changing business landscape."
    },
    {
      "title": "Consulting for Growth",
      "description": "Our consultants bring real-world expertise to help companies streamline operations, improve decision-making, and build scalable business models."
    },
    {
      "title": "Manpower Support Services",
      "description": "We help organizations find, retain, and manage top talent. Whether you need contract staffing, permanent hires, or project-based support, DCM delivers workforce solutions that work."
    }
  ]
}